---
title: SSEPointVisibilitySettings
classe: Autodesk.Revit.DB.SSEPointVisibilitySettings
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# SSEPointVisibilitySettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean GetVisibility(Document, ElementId)` | `SSEPointVisibilitySettings.GetVisibility(document, categoryId)` | Boolean |
| `Void SetVisibility(Document, ElementId, Boolean)` | `SSEPointVisibilitySettings.SetVisibility(document, categoryId, isVisible)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```